In [1]:
# import netCDF4
import pandas as pd
import datetime as dt
import numpy as np
import csv
import calendar

import os,sys,inspect
current_dir = os.path.dirname(os.path.abspath(inspect.getfile(inspect.currentframe())))
#parent_dir = os.paths.dirname(current_dir)
sys.path.insert(0, current_dir) 
from environmentVariables import environment_variables

In [2]:
user_key=environment_variables['eshta']
pd.set_option('display.precision', 12)

# INPUT

In [708]:
# read files

data=pd.read_csv(user_key['path_in']+'/tasmin/tasmin_20010101-20051231.csv', header=None)
data_time = pd.read_csv(user_key['path_in']+'/tasmin/time_20010101-20051231.csv', header=None)

In [709]:
print(len(data))
# print(data)

474500

In [710]:
# first position
data.iloc[0:5, 0:4]

           0          1          2          3
0  298.10632  298.07672  298.06058  298.03635
1  297.95428  297.93140  297.90717  297.87488
2  297.79280  297.75107  297.71475  297.67706
3  297.59903  297.55328  297.51425  297.47253
4  297.38240  297.33260  297.29626  297.24243

In [711]:
# values around first position for toronto
data.iloc[117:122, 210:214]

           210        211        212        213
117  267.43300  267.29843  266.93646  267.30652
118  267.12890  267.31458  273.87985  274.04670
119  266.64716  266.12506  274.00500  274.22568
120  265.88420  265.30826  265.40380  273.88120
121  265.53836  265.08893  264.29907  264.60990

In [712]:
# first position for toronto
var = data.iloc[119, 211] 
print(var)

266.12506

In [713]:
# values around second position for toronto
data.iloc[378:382, 212:217]

           212        213        214        215        216
378  274.40125  274.51413  270.50880  271.43120  271.07200
379  274.27167  274.54750  274.65652  274.63217  271.98544
380  268.00192  274.27680  274.59753  274.70657  274.65652
381  266.41748  267.61447  274.14978  274.48718  274.67834

In [714]:
# second position for toronto
counter = 260
var = data.iloc[119+counter, 211] 
print(var)

267.93008

# Calculate num of leap years

In [715]:
# Input list initialization
input_list = [1950, 1951, 1952, 1953, 1954, 1955,
         1956, 1957, 1958, 1959, 1960,
         1961, 1962, 1963, 1964, 1965, 
         1966, 1967, 1968, 1969, 1970, 
         1971, 1972, 1973, 1974, 1975, 
         1976, 1977, 1978, 1979, 1980, 
         1981, 1982, 1983, 1984, 1985
        ,1986, 1987, 1988, 1989, 1990
        ,1991, 1992, 1993, 1994, 1995
        ,1996, 1997, 1998, 1999, 2000
        ]

In [716]:
def findLeapYear(input_list):
    ans = 0
    for elem in input_list:
        if calendar.isleap(int(elem)):
            ans = ans + 1
    return ans

numleap = findLeapYear(input_list)
print(numleap)

13

# Extract based on rlat and rlon

In [717]:
rlon_x = 211 # adjusted from 212 since headers start at 0
rlat_y = 119 # adjusted from 120 since index starts at 0
counter = 0

list_of_vars = []

 
while (rlat_y+counter) < len(data)-1:
    var = data.iloc[rlat_y+counter, rlon_x]
    list_of_vars.append(var)
        
    counter+=260 

len(list_of_vars) #should always be 1825

1825

In [718]:
#read data_time and transpose into column and append variable and date info to new df
data_all = data_time.transpose()
data_all.insert(1, 'Variable', list_of_vars)
data_all = data_all.rename(columns={0: 'Date'})

In [719]:
data_all

         Date   Variable
0     18646.5  266.12506
1     18647.5  267.93008
2     18648.5  270.53894
3     18649.5  276.02680
4     18650.5  272.79110
...       ...        ...
1820  20466.5  272.24738
1821  20467.5  272.01850
1822  20468.5  274.22223
1823  20469.5  273.85046
1824  20470.5  273.55300

[1825 rows x 2 columns]

# Change time units - new

In [720]:
startdate = "12/01/1949"
temp = pd.to_datetime(startdate) + pd.DateOffset(days= 13171.5 +numleap)

In [721]:
print(temp)

1986-01-05 12:00:00

In [722]:
# change time units from 'days since 12/01/1949' to actual date
startdate = "12/01/1949"
row_iterator = data_all.iterrows()
counter = 1

for i, row in row_iterator:
    if counter != len(data_all)+1:
        #temp = pd.to_datetime(startdate) + pd.DateOffset(days=data_all.at[i, 'Date']+9)
        #if temp.month != 2 and temp.day != 29:
            #data_all.at[i, 'Date_new'] = pd.to_datetime(temp)
        data_all.at[i, 'Date_new'] = pd.to_datetime(startdate) + \
                                     pd.DateOffset(days=data_all.at[i, 'Date']+numleap)
            #data_all.at[i, 'Date_new2'] = pd.to_datetime(data_all.at[i, 'Date_new']) + pd.DateOffset(days=9)
            
    counter += 1

data_all['Date_new'] = pd.to_datetime(data_all['Date_new']).dt.date

In [723]:
# flag leap years

row_iterator = data_all.iterrows()
counter = 1

for i, row in row_iterator:
    if counter != len(data_all)+1:
        if data_all.at[i, 'Date_new'].month == 2 and data_all.at[i, 'Date_new'].day == 29:
             data_all.at[i, 'flag'] = 'flag'

    counter += 1

In [724]:
# if flag, change flagged date to +1

row_iterator = data_all.iterrows()
counter2 = 1

for i, row in row_iterator:
    if counter2 != len(data_all)+1:
        if data_all.at[i, 'flag'] == 'flag':
            data_all.at[i, 'Date_2'] = data_all.at[i+1, 'Date_new']
    counter2+=1

In [725]:
# copy over date from before if Date_2 is null 
# otherwise keep the value in Date_2

row_iterator = data_all.iterrows()
counter3 = 1
numberofflags = 0

for i, row in row_iterator:
    if counter3 != len(data_all)+1:
        if data_all.at[i, 'flag'] == 'flag':
            numberofflags+=1
        temp = data_all.at[i, 'Date_new'] + pd.DateOffset(days=numberofflags)
        if (temp.month == 2 and temp.day == 29):
            data_all.at[i, 'Date_2'] = data_all.at[i, 'Date_new'] + pd.DateOffset(days=numberofflags+1)
        else:
            data_all.at[i, 'Date_2'] = data_all.at[i, 'Date_new'] + pd.DateOffset(days=numberofflags)


    counter3+=1

data_all['Date_2'] = pd.to_datetime(data_all['Date_2']).dt.date

In [726]:
data_all

         Date   Variable    Date_new flag      Date_2
0     18646.5  266.12506  2001-01-01  NaN  2001-01-01
1     18647.5  267.93008  2001-01-02  NaN  2001-01-02
2     18648.5  270.53894  2001-01-03  NaN  2001-01-03
3     18649.5  276.02680  2001-01-04  NaN  2001-01-04
4     18650.5  272.79110  2001-01-05  NaN  2001-01-05
...       ...        ...         ...  ...         ...
1820  20466.5  272.24738  2005-12-26  NaN  2005-12-27
1821  20467.5  272.01850  2005-12-27  NaN  2005-12-28
1822  20468.5  274.22223  2005-12-28  NaN  2005-12-29
1823  20469.5  273.85046  2005-12-29  NaN  2005-12-30
1824  20470.5  273.55300  2005-12-30  NaN  2005-12-31

[1825 rows x 5 columns]

# OUTPUT

In [727]:
# delete unnecessary columns
del data_all['Date']
del data_all['Date_new']
del data_all['flag']

# rename column
data_all = data_all.rename(columns={'Date_2': 'Date'})

In [728]:
# reorder column
data_all = data_all[['Date', 'Variable']]

In [729]:
data_all.to_csv(user_key['extracted_loc_raw']+'/model_raw_clean/tasmin/tasmin_extrTO_2001-2005.csv', index=None)

# LEGACY CODE

# Change time units

In [619]:
# # change time units from 'days since 12/01/1949' to actual date
# startdate = "12/01/1949"
# row_iterator = data_time.iterrows()
# counter = 1
# data_ActualDate = df = pd.DataFrame(columns = ['Date_new'])
# for i, row in row_iterator:
#     if counter != len(data_time) + 1:
#         temp = pd.to_datetime(startdate) + pd.DateOffset(days=data_time.at[i, 'Date'] + 9)
#         if (temp.month == 2 and temp.day == 29):
#             random = 1
#         else:
#             #data_all = data_time 
#             #data_all.at[i, 'Variable'] = pd.to_datetime(startdate) + pd.DateOffset(days=data_all.at[i, 'Date'] + 9)            
#             data_all.at[i, 'Date_new'] = pd.to_datetime(startdate) + pd.DateOffset(days=data_all.at[i, 'Date'] + 9)      
#          #   data = pd.to_datetime(startdate) + pd.DateOffset(days=data_time.at[i, 'Date'] + 9)
            
#         #    data_ActualDate = data_ActualDate.append({'Date_new' : data}, ignore_index=True)
            
#             #data_all.at[i, 'Date_new2'] = pd.to_datetime(data_all.at[i, 'Date_new']) + pd.DateOffset(days=9)
            
#     counter += 1

# data_ActualDate['Date_new'] = pd.to_datetime(data_ActualDate['Date_new']).dt.date
# #data_all.dropna(subset = ['Date_new'], inplace=True)
# #print(data_ActualDate.to_string())
# #data_ActualDate.to_csv(user_key['csv_loc_raw']+'/pr/pr_output_1986-1990-test3.csv', index=None)

In [548]:
# flag leap years

# row_iterator = data_all.iterrows()
# counter = 1

# for i, row in row_iterator:
#     if counter != len(data_all)-1:
#         if data_all.at[i, 'Date_new'].month == 2 and data_all.at[i, 'Date_new'].day == 29:
#              data_all.at[i, 'flag'] = 'flag'

#     counter += 1

In [549]:
# change leap year date to blank

#row_iterator = data_all.iterrows()
#counter2 = 1

#for i, row in row_iterator:
#    if counter2 != len(data_all)-1:
#        if data_all.at[i, 'flag'] == 'flag':
#            data_all.at[i, 'Date_2'] = data_all.at[i+1, 'Date_new']
#    counter2+=1

# Check and solve nulls

In [550]:
# forward fill leap year with next date and adjust following dates

#row_iterator = data_all.iterrows()
#counter3 = 1

#for i, row in row_iterator:
#    if counter3 != len(data_all)-1:

In [551]:
# # check for any nulls
# data_ActualDate.isnull().sum()

In [552]:
# # find null value
# null_val = data_ActualDate[data_ActualDate['Date_new'].isnull()].index.tolist()
# data_ActualDate.iloc[null_val]

In [31]:
# temp = pd.to_datetime(startdate) + pd.DateOffset(days=18644.5+9)
# print(temp)

In [32]:
# # handle null value by filling in

# data_ActualDate.iloc[1823,2] = pd.to_datetime('12/28/1995')
# data_ActualDate['Date_new'] = pd.to_datetime(data_ActualDate['Date_new']).dt.date

# #data_time = data_time[['Date_new', 'Variable']]
# #data_time.columns = ['Date', 'Variable']

In [33]:
# data_all = data_time
# data_all.insert(1, 'Variable', list_of_vars)
# data_all.insert(2,'Date_new',data_ActualDate)